КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул2_5_02/КонтурЛогистика_ПЛ_Титул2_5_02.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>КонтурЛогистика_ПЛ_Титул2_5_02</name>
  <posting>Deny</posting>
  <attributes>
    <name>ДокументОснование</name>
    <type>
      <types>DefinedType.КонтурЛогистика_ДокументыУчетнойСистемы</types>
    </type>
  </attributes>
  <attributes>
    <name>Титул1</name>
    <type>
      <types>DocumentRef.КонтурЛогистика_ПЛ_Титул1_5_02</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>будет отображаться только в диадоке, не попадет в ЭтРН</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатИнфМО</name>
    <comment>Дата формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрИнфМО</name>
    <comment>Время формирования файла обмена информации о результате предсменного, предрейсового медицинского осмотра</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатФайлИнфСоб</name>
    <comment>Дата формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВрФайлИнфСоб</name>
    <comment>Время формирования файла обмена Т1</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Time</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИдФайлИнфСоб</name>
    <comment>Идентификатор файла обмена Т1</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭПСоб</name>
    <comment>Электронная подпись файла обмена информации об обстоятельствах и особенностях рейса</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидМОПредсменный</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Должность</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>128</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ТипПодпис</name>
    <type>
      <types>EnumRef.КонтурЛогистика_ТипыПодписи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпосПодтПолном</name>
    <type>
      <types>EnumRef.КонтурЛогистика_СпособыПодтвержденияПолномочий</types>
    </type>
  </attributes>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Имя</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Отчество</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>60</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПользовательПодписант</name>
    <type>
      <types>DefinedType.КонтурЛогистика_Пользователи1С</types>
    </type>
  </attributes>
  <attributes>
    <name>ПараметрНастроекПодписания</name>
    <comment>Параметр используется для поиска подписанта по дополнительному параметру</comment>
    <type>
      <types>DefinedType.КонтурЛогистика_ЗначениеНастроек</types>
    </type>
  </attributes>
  <attributes>
    <name>ПричинаОтказаВПодписи</name>
    <comment>текст содержащий причину отказа</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>1000</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЕстьОтказВПодписи</name>
    <comment>признак отказа в подписи</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>МедРаботник</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатВрПрМО</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.КонтурЛогистика_Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>МедЛицензия</name>
    <comment>Лицензия на осущ. мед. деятельности</comment>
    <type>
      <types>CatalogRef.КонтурЛогистика_Лицензии</types>
    </type>
  </attributes>
  <attributes>
    <name>ДистанционныйМедОсмотр</name>
    <comment>Признак использования медицинских изделий, обеспечивающих автоматизированную дистанционную передачу информации о состоянии здоровья работников и дистанционный контроль состояния их здоровья</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДопСведенияОПодписанте</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>255</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>ДополнительныеПолучателиФайла</name>
    <attributes>
      <name>ОрганизацияДиадок</name>
      <type>
        <types>CatalogRef.КонтурЛогистика_ОрганизацииДиадок</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИнфПол</name>
    <comment>Информационные поля</comment>
    <attributes>
      <name>ИдФайлИнфПол</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Идентиф</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>50</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <comment>T(1-2000)</comment>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

КАКерамика_моя_старая_база/src/Documents/КонтурЛогистика_ПЛ_Титул2_5_02/Forms/ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОбновитьДанныеФормы();
	
	КонтекстНастройкиКонвертации = КонтурЛогистика_КонвертацияСерверПовтИсп.КонтекстНастройкиКонвертацииУчетногоДокумента(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02);
	
	Если ЗначениеЗаполнено(КонтекстНастройкиКонвертации.НастройкаКонвертации) Тогда
		Элементы.ГруппаДокументОснование.Видимость = ЗначениеЗаполнено(КонтекстНастройкиКонвертации.ТипДокумента1С);
	КонецЕсли;
	
	ЭлементыДляРазрешенияРедактирования = Новый Массив;
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаЭП");
	ЭлементыДляРазрешенияРедактирования.Добавить("ГруппаДанныеФайлаТитула1");
	
	КонтурЛогистика_ОбщегоНазначенияСервер.ПриСозданииНаСервере(ЭтаФорма, Отказ, СтандартнаяОбработка, ЭлементыДляРазрешенияРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	УправлениеВидимостьюИДоступностью();
	ПроверитьДокумент();
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПриОткрытииНаКлиенте(ЭтаФорма, Отказ);
	
	УстановитьЗаголовкиГруппамДопПолей();
	
	Если КонтурЛогистика_ОбщегоНазначенияКлиентСервер.ЭтоИнтерфейс82() Тогда
		Элементы.ИнфПол.РастягиватьПоВертикали = Ложь;
		Элементы.ДополнительныеПолучателиФайла.РастягиватьПоВертикали = Ложь;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия = "КонтурЛогистика_ИзменениеДокумента" И Параметр = Объект.Ссылка Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
				
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьОткрытыеТитулы" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьЗадачи" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ЗакрытьФормыТитулов" 
		И Параметр <> Неопределено 
		И ТипЗнч(Параметр) = Тип("Массив") 
		И Параметр.Найти(Объект.Ссылка) <> Неопределено Тогда 
		
		ПодключитьОбработчикОжидания("ОбработчикЗакрытьФорму", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьДокументЛогистики" Тогда
		
		ПодключитьОбработчикОжидания("ОбработчикПеречитатьОбъект", 0.1, Истина);
		
	ИначеЕсли ИмяСобытия = "КонтурЛогистика_ОбновитьФормуТитула" Тогда
		
		ОбновитьФорму();
		
	ИначеЕсли ИмяСобытия = "ПерезаполнитьТитул"
		И Параметр <> Неопределено
		И Параметр = Объект.Ссылка Тогда
		
		ПерезаполнитьПоДокОснованиюСервер();
		ОбновитьДанныеФормы();
		ОбновитьОтображениеДанных();
		ПроверитьДокумент();
		
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
Процедура ПользовательПодписантПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПричинаОтказаВПодписиПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ВодительПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МедРаботникПриИзменении(Элемент)
	
	Если ЗначениеЗаполнено(Объект.МедРаботник) Тогда 
		
		МедЛицензияЛок = КонтурЛогистика_ОбщегоНазначенияКлиент.ЗначениеРеквизитаОбъекта_КонтурЛогистика(
			Объект.МедРаботник, "МедЛицензия");
		
		Если ЗначениеЗаполнено(МедЛицензияЛок) Тогда
			Объект.МедЛицензия = МедЛицензияЛок;
		КонецЕсли;
		
	КонецЕсли;
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура МедЛицензияПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДатВрПрМОПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПунктКолбасыНажатие(Элемент)
	
	КонтурЛогистика_ОбщегоНазначенияКлиент.ПерейтиПоКолбасеКТитулу(ЭтаФорма, Элемент);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Перепроверить(Команда = Неопределено)
	
	РезультатПроверки = ПроверитьДокумент();
	
	// если есть ошибки или предупреждения то нажатие всегда показывает панель ошибок (в свернутом или развернутом виде)
	
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки);

КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМинимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.МинимизироватьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ПанельОшибокМаксимизировать(Команда)
	
	КонтурЛогистика_ПанельОшибокКлиент.ПоказатьПанельОшибок(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ВремяМедосмотраСейчас(Команда)
	
	Объект.ДатВрПрМО = ТекущаяДатаСервера();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ПеречитатьОбъект(Команда)
	
	ОбработчикПеречитатьОбъект();
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьНастройкуКонвертации(Команда)

	КонтурЛогистика_ОбработкаДокументовКлиент.ОткрытьНастройкуКонвертации(
		ПредопределенноеЗначение("Перечисление.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02"), Объект.ДокументОснование);

КонецПроцедуры

&НаКлиенте
Процедура КомандаСтатусПодписиСертификатаМЧД(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаСтатусПодписиСертификатаМЧД(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура КомандаДокументОснование(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.КомандаДокументОснование(ЭтаФорма, Команда.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура РазрешитьРедактированиеРеквизитов(Команда)
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.РазрешитьРедактированиеРеквизитов(ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийТабличныхЧастей

&НаКлиенте
Процедура ТаблицаОшибокВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	КонтурЛогистика_ПанельОшибокКлиент.ТаблицаОшибокВыбор(ЭтаФорма, Объект, Поле.Имя);
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриИзменении(Элемент)
	
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ИнфПолПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПриОкончанииРедактирования(Элемент, НоваяСтрока, ОтменаРедактирования)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

&НаКлиенте
Процедура ДополнительныеПолучателиФайлаПослеУдаления(Элемент)
	
	УстановитьЗаголовкиГруппамДопПолей();
	ПроверитьДокумент();
	
КонецПроцедуры

#КонецОбласти

#Область ОбновлениеФормы

&НаКлиенте
Процедура ОбработчикПеречитатьОбъект()
	
	ЭтаФорма.Прочитать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьФорму()

	ОбновитьДанныеФормы();
	ПроверитьДокумент();
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.УправлениеЭлементамиДокументОснование(ЭтаФорма, Объект.ДокументОснование);
	УправлениеКолбасойТитуловВызовСервера();
	
КонецПроцедуры

&НаСервере
Процедура ОбновитьДанныеФормы()
	
	ТекущийСтатус = РегистрыСведений.КонтурЛогистика_СтатусыТитулов.ПолучитьСтатус(Объект.Ссылка, Истина);
	
	Если ТекущийСтатус = Перечисления.КонтурЛогистика_СтатусыТитулов.Ошибка Тогда 
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Повторно подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Переотправить неподписанный (черновик)";
	Иначе
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ПодписатьИОтправить.Заголовок = "Подписать и отправить";
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтправитьНеподписанный.Заголовок = "Отправить неподписанный (черновик)";
	КонецЕсли;

	КонтурЛогистика_ОбработкаДокументовСервер.УстановитьЗаголовокКнопкеПоУмолчанию(Объект.Ссылка, Объект.ДокументОснование,
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ВыполнитьДействияПоУмолчанию, ТекущийСтатус, ТребуемоеДействие);
	
	КонтурЛогистика_ОбработкаДокументовСервер.ПЛ_ФормаДокумента_УстановитьВидимостьВЗависимостиОтСтатуса(ЭтаФорма);
	
	ЗаполнитьПредставлениеРеквизитовДокументаОснования();
	
	СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы = КонтурЛогистика_ОбщегоНазначенияСерверПовтИсп.ЗначениеНастройки(
		"СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы");
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ДобавитьПечатнуюФормуЭПДВПрикрепленныеФайлы.Видимость = СохранятьПечатнуюФормуЭПДВПрисоединенныеФайлы;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура УправлениеВидимостьюИДоступностью()
	
	ЭтоВходящий = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Получен");
	ЭтоЧерновик = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	ЭтоИсправлениеОшибки = ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Ошибка");
	
	Элементы.ГруппаПодписантРеквизиты.Видимость = ЗначениеЗаполнено(Объект.Фамилия);
	
	// причина отказа в подписи 
	Элементы.ГруппаПричинаОтказаВПодписи.Видимость = (ЭтоВходящий Или Не ЭтоЧерновик) И Объект.ЕстьОтказВПодписи;
	
	Элементы.ГруппаДатВрПрМО.Видимость 			= Не Объект.ЕстьОтказВПодписи;
	Элементы.ВремяМедосмотраСейчас.Видимость 	= Не Объект.ЕстьОтказВПодписи;
	
	Если Объект.ЕстьОтказВПодписи Тогда 
		Элементы.ЕстьОтказВПодписи.ЦветТекста = WebЦвета.Красный;
	КонецЕсли;
	
	Элементы.ЕстьОтказВПодписи.Видимость = ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПодготовленКОтправке")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.СформированыФайлыОбмена")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Пропущен")
		И ТекущийСтатус <> ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка");
	
	Если Элементы.Найти("ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи") <> Неопределено Тогда
		Элементы.ФормаОбщаяКомандаКонтурЛогистика_ОтказатьсяВПодписи.Видимость = Не ТолькоПросмотр;
	КонецЕсли;
	
	Элементы.ГруппаДатаФормированияФайла.Видимость = ЗначениеЗаполнено(Объект.ДатИнфМО);
			
КонецПроцедуры

&НаКлиенте
Процедура УстановитьЗаголовкиГруппамДопПолей()
	
	// ГруппаИнфПоля
	Элементы.ГруппаИнфПоля.Заголовок = "Информационные поля (" + Объект.ИнфПол.Количество() +")";
	
	// ГруппаДопПолучатели
	Элементы.ГруппаДопПолучатели.Заголовок = "Доп. получатели файла (" + Объект.ДополнительныеПолучателиФайла.Количество() +")";
					
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УправлениеКолбасойТитуловВызовСервера()
	
	КонтурЛогистика_ОбщегоНазначенияСервер.УправлениеСтатусомПодписиИКолбасойТитулов(ЭтаФорма);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикЗакрытьФорму()
	
	ЭтаФорма.Закрыть();

КонецПроцедуры

&НаКлиенте
Процедура ОбработчикПерепроверить(Параметр1 = Неопределено, Параметр2 = Неопределено) Экспорт
	
	Перепроверить();
	
КонецПроцедуры

&НаКлиенте
Функция ПроверитьДокумент()
	
	РезультатПроверки = ПроверитьДокументСервер();
	
	ВсегдаВыводитьРезультатВалидации = ВсегдаВыводитьРезультатВалидации();
	КонтурЛогистика_ПанельОшибокКлиент.ОбновитьСостояниеПанели(ТекущийСтатус, ЭтаФорма, РезультатПроверки, ВсегдаВыводитьРезультатВалидации);
	
	УправлениеВидимостьюИДоступностью();
	
	Возврат РезультатПроверки;
		
КонецФункции

&НаСервере
Функция ПроверитьДокументСервер()
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	
	РезультатыПроверкиДокумента = Документы.КонтурЛогистика_ПЛ_Титул2_5_02.ПроверитьДокумент(ДокОбъект, ТаблицаОшибок);
	
	РезультатПроверки = КонтурЛогистика_ПанельОшибокСервер.ПолучитьРезультатПроверки(ТаблицаОшибок);
	
	Возврат РезультатПроверки;
	
КонецФункции

&НаСервере
Процедура ПерезаполнитьПоДокОснованиюСервер()
	
	Объект.ИнфПол.Очистить();
	
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	ДокОбъект.ЗаполнитьЧерезНастройкиКонвертации();
	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");
	
	Модифицированность = Истина;
	
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьФормуПодбораСущностиЛогистика(Знач ОбъектУчетнойСистемы, Знач Элемент)

	ПараметрыФормыПоиска = Новый Структура();
	ПараметрыФормыПоиска.Вставить("ОбъектУчетнойСистемы", ОбъектУчетнойСистемы);

	ПараметрыОбработчика = Новый Структура();
	ПараметрыОбработчика.Вставить("ИмяЭлементаФормы", Элемент.Имя);

	Если Элемент.Имя = "ДокУчСист_МедРаботник_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Сотрудники";

	ИначеЕсли Элемент.Имя = "ДокУчСист_МедЛицензия_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_Лицензии";

	ИначеЕсли Элемент.Имя = "ДокУчСист_ОрганизацияОдометр_Сопоставить" Тогда

		ИмяСущности = "КонтурЛогистика_ОрганизацииДиадок";
		
	Иначе

		ВызватьИсключение "не реализовано";

	КонецЕсли;

	КонтурЛогистика_ОбщегоНазначенияКлиент.ОткрытьФорму_Подсистемы("Справочник." + ИмяСущности + ".ФормаВыбора", ПараметрыФормыПоиска, ЭтаФорма,
		ЭтаФорма, "ОбработчикВыбораСопоставленияРеквизитаДокумента", ПараметрыОбработчика);
КонецПроцедуры

&НаКлиенте
Процедура ОбработчикВыбораСопоставленияРеквизитаДокумента(ВыбранноеЗначение, ДопПараметры) Экспорт

	Если ВыбранноеЗначение <> Неопределено Тогда 
		
		// Выполнить переконвертацию или присваивание
		ПовторноСконвертироватьРеквизит(ДопПараметры.ИмяЭлементаФормы);
		ОбработчикПеречитатьОбъект();

	КонецЕсли;

КонецПроцедуры

&НаСервере
Процедура ПовторноСконвертироватьРеквизит(ИмяЭлементаФормы)

	ДокОбъект = РеквизитФормыВЗначение("Объект");


	ИмяРеквизита = СтрЗаменить(ИмяЭлементаФормы, "ДокУчСист_", "");
	ИмяРеквизита = СтрЗаменить(ИмяРеквизита, "_Сопоставить", "");
	
	ДанныеЗаполнения = Новый Структура("ПредыдущийТитул, ТипЛогистика",
									   Объект.Титул1,
									   Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02);
	ДокОбъект.Заполнить(ДанныеЗаполнения);

	ЗначениеВРеквизитФормы(ДокОбъект, "Объект");

КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПредставлениеРеквизитовДокументаОснования()
	
	МассивКонвертируемыхРеквизитов = СоответствиеКонвертируемыхРеквизитовИзДокУчСист();
	
	КонтурЛогистика_ОбработкаДокументовСервер.ЗаполнитьПредставлениеРеквизитовДокументаОснования(
		Перечисления.КонтурЛогистика_ТипыЛогистическихДокументов.ПЛ_Титул2_5_02, МассивКонвертируемыхРеквизитов, ЭтаФорма);	
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция СоответствиеКонвертируемыхРеквизитовИзДокУчСист()

	Перем МассивКонвертируемыхРеквизитов;

	МассивКонвертируемыхРеквизитов = Новый Соответствие();
	МассивКонвертируемыхРеквизитов.Вставить("МедРаботник", "МедРаботник");
	МассивКонвертируемыхРеквизитов.Вставить("МедЛицензия", "МедЛицензия");
	
	Возврат МассивКонвертируемыхРеквизитов;

КонецФункции

&НаКлиенте
Процедура ОбработчикРазрешенияПолномочий(Параметр1, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработчикРазрешенияПолномочий(ЭтаФорма, ДополнительныеПараметры);
		
КонецПроцедуры

&НаКлиенте
Процедура ОбработатьВыборДокументаОснования(ВыбранноеЗначение, ДополнительныеПараметры) Экспорт
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ОбработатьВыборДокументаОснование(ВыбранноеЗначение, Объект, ЭтаФорма);
			
КонецПроцедуры

&НаКлиенте
Процедура ДокументОснованиеОчистка(Элемент, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	КонтурЛогистика_РаботаСЭлементамиФормыКлиент.ПриОчисткеДокументаОснование(ЭтаФорма, Объект.ДокументОснование);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ТекущаяДатаСервера()
	
	Возврат ТекущаяДатаСеанса();
	
КонецФункции

&НаКлиенте
Функция ВсегдаВыводитьРезультатВалидации()
	
	Возврат ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.ПустаяСсылка")
		Или ТекущийСтатус = ПредопределенноеЗначение("Перечисление.КонтурЛогистика_СтатусыТитулов.Черновик");
	
КонецФункции

#КонецОбласти

#Область Команды

&НаКлиенте
Процедура КонтурЛогистикаПодключаемый_ВыполнитьКоманду(Команда)
	
    КонтурЛогистика_ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтаФорма, Команда, РеквизитыФормы());
	
КонецПроцедуры

#КонецОбласти

&НаСервере
Функция РеквизитыФормы()
	
	Возврат КонтурЛогистика_ОбщегоНазначенияСервер.РеквизитыФормы(ЭтаФорма);
	
КонецФункции
